#include <stdio.h>

int main() {
    int x = 3720; //4-розрядне число у системi числення 8

    //Для переказу необхідно помножити розряд числа на відповідну йому ступінь розряду
   
  
  
    int x1 = x/1000;           // Перша цифра в числі
    int o = x%1000;           // ОСтача від ділення на 1000
    int x2 = o/100;           // При діленні остачі на 100 знаходимо другу цифру 
    int o2 = o%100;           // Другий залишок
    int x3 = o2/10;           // Третя цифра в числi
    int x4 = o2%10;           // Четверта цифра в числi
                              
                          
    int y = 8*8*8*x1 + 8*8*x2 + 8*x3 + 1*x4;  //Еквiвалент
                                            
  
    return 0;
    
  
}
