#include <stdio.h>

int main()
{
    int x1; // найменше число діапазону 
    int x2; // найбільше число діапаону
    int a; 
    int k; // найбільший спільний дільник
    
    for(a=1; a<= x1 && a <= x2; ++a) //відомо щoo НДС обов'язково повинен належати діапазону, тому звернимося до циклу де звернимося до кожного значення(цілого) 
                                     // та знайдемо найбільше в якому виконуеться умова діленні без остачі
    {
  
        if(x1%i==0 && x2%i==0) 
            k = a;
    }

    return 0;
  
  
}
