#include <stdio.h>
int main()
{
    int x;                            // якесь число
    int a;                             
    int res;                         

    for (a=> 2; a <= x -1; ++a) {    // Якщо при діленні, число ділиться числом, яке налнжить діапазону де наййменши є 2, а набільшим саме число-1, націло- то воно не просте 
                      
        if (x % a == 0) {             
            res = 1;                 //якщо дільників більше 2, res = 1
            break;
        }
    }
    if (x == 1) {                     
    }
    else {
        if (res == 0)                //  аналогічно для іншого варіанту  
    }

    return 0;
}
